binaryninja/ESP-C6/firmware/components/tinymcp/src/esp32_transport.cpp
/**
 * @file esp32_transport.cpp
 * @brief ESP32-C6 MCP Transport Layer Implementation
 * 
 * This file implements the transport layer for MCP communication on ESP32-C6,
 * supporting UART/USB CDC with message framing and flow control.
 */

#include "esp32_transport.h"

#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include "esp_log.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_heap_caps.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"
#include "driver/uart.h"
#include "driver/gpio.h"

static const char *TAG = "MCP_TRANSPORT";

/* Transport Internal Structure */
typedef struct esp32_mcp_transport {
    /* Configuration */
    mcp_transport_config_t config;
    
    /* State */
    bool initialized;
    bool running;
    mcp_transport_state_t state;
    
    /* UART specific */
    uart_port_t uart_port;
    QueueHandle_t uart_queue;
    
    /* Tasks */
    TaskHandle_t rx_task;
    TaskHandle_t tx_task;
    
    /* Synchronization */
    SemaphoreHandle_t mutex;
    QueueHandle_t tx_queue;
    
    /* Buffers */
    uint8_t* rx_buffer;
    uint8_t* tx_buffer;
    uint8_t* frame_buffer;
    
    /* Message framing */
    uint8_t* partial_message;
    size_t partial_length;
    bool in_frame;
    bool escape_next;
    
    /* Callbacks */
    mcp_transport_event_cb_t event_callback;
    mcp_transport_message_cb_t message_callback;
    void* callback_user_data;
    
    /* Statistics */
    mcp_transport_stats_t stats;
    
} esp32_mcp_transport_t;

/* Forward declarations */
static void mcp_transport_rx_task(void* arg);
static void mcp_transport_tx_task(void* arg);
static esp_err_t mcp_transport_uart_init(esp32_mcp_transport_t* transport);
static esp_err_t mcp_transport_uart_deinit(esp32_mcp_transport_t* transport);
static esp_err_t mcp_process_received_data(esp32_mcp_transport_t* transport, 
                                          const uint8_t* data, size_t length);
static void mcp_transport_set_state(esp32_mcp_transport_t* transport, 
                                   mcp_transport_state_t new_state);
static void mcp_transport_send_event(esp32_mcp_transport_t* transport, 
                                    mcp_transport_event_t event, void* data);

/* Get default transport configuration */
esp_err_t esp32_mcp_transport_get_default_config(mcp_transport_type_t type,
                                                 mcp_transport_config_t* config)
{
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    
    memset(config, 0, sizeof(mcp_transport_config_t));
    
    config->type = type;
    config->rx_buffer_size = MCP_TRANSPORT_RX_BUFFER_SIZE;
    config->tx_buffer_size = MCP_TRANSPORT_TX_BUFFER_SIZE;
    config->queue_size = MCP_TRANSPORT_QUEUE_SIZE;
    config->timeout_ms = MCP_TRANSPORT_TIMEOUT_MS;
    config->enable_framing = true;
    config->enable_flow_control = false;
    
    switch (type) {
        case MCP_TRANSPORT_TYPE_UART:
        case MCP_TRANSPORT_TYPE_USB_CDC:
            config->config.uart.uart_num = MCP_UART_NUM;
            config->config.uart.baud_rate = MCP_UART_BAUD_RATE;
            config->config.uart.data_bits = MCP_UART_DATA_BITS;
            config->config.uart.parity = MCP_UART_PARITY;
            config->config.uart.stop_bits = MCP_UART_STOP_BITS;
            config->config.uart.flow_ctrl = MCP_UART_FLOW_CTRL;
            config->config.uart.tx_pin = UART_PIN_NO_CHANGE;
            config->config.uart.rx_pin = UART_PIN_NO_CHANGE;
            config->config.uart.rts_pin = UART_PIN_NO_CHANGE;
            config->config.uart.cts_pin = UART_PIN_NO_CHANGE;
            break;
            
        case MCP_TRANSPORT_TYPE_WIFI_TCP:
            config->config.tcp.port = 80;
            config->config.tcp.bind_addr = "0.0.0.0";
            config->config.tcp.max_connections = 4;
            config->config.tcp.keepalive_idle = 7200;
            config->config.tcp.keepalive_interval = 75;
            config->config.tcp.keepalive_count = 9;
            break;
            
        case MCP_TRANSPORT_TYPE_BLE:
            config->config.ble.device_name = "ESP32-C6-MCP";
            config->config.ble.service_uuid = "12345678-1234-5678-9abc-123456789abc";
            config->config.ble.char_uuid = "87654321-4321-8765-cba9-987654321cba";
            config->config.ble.mtu_size = 512;
            break;
            
        default:
            return ESP_ERR_NOT_SUPPORTED;
    }
    
    return ESP_OK;
}

/* Initialize transport layer */
esp_err_t esp32_mcp_transport_init(const mcp_transport_config_t* config,
                                   esp32_mcp_transport_handle_t* transport_handle)
{
    if (!config || !transport_handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    ESP_LOGI(TAG, "Initializing MCP transport (type: %d)", config->type);
    
    /* Allocate transport structure */
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)heap_caps_calloc(1, 
                                        sizeof(esp32_mcp_transport_t), MALLOC_CAP_DEFAULT);
    if (!transport) {
        ESP_LOGE(TAG, "Failed to allocate transport structure");
        return ESP_ERR_NO_MEM;
    }
    
    /* Copy configuration */
    memcpy(&transport->config, config, sizeof(mcp_transport_config_t));
    
    /* Create synchronization objects */
    transport->mutex = xSemaphoreCreateMutex();
    if (!transport->mutex) {
        ESP_LOGE(TAG, "Failed to create mutex");
        free(transport);
        return ESP_ERR_NO_MEM;
    }
    
    transport->tx_queue = xQueueCreate(config->queue_size, sizeof(mcp_transport_message_t*));
    if (!transport->tx_queue) {
        ESP_LOGE(TAG, "Failed to create TX queue");
        vSemaphoreDelete(transport->mutex);
        free(transport);
        return ESP_ERR_NO_MEM;
    }
    
    /* Allocate buffers */
    transport->rx_buffer = (uint8_t*)heap_caps_malloc(config->rx_buffer_size, MALLOC_CAP_DEFAULT);
    transport->tx_buffer = (uint8_t*)heap_caps_malloc(config->tx_buffer_size, MALLOC_CAP_DEFAULT);
    transport->frame_buffer = (uint8_t*)heap_caps_malloc(config->tx_buffer_size * 2, MALLOC_CAP_DEFAULT);
    transport->partial_message = (uint8_t*)heap_caps_malloc(config->rx_buffer_size, MALLOC_CAP_DEFAULT);
    
    if (!transport->rx_buffer || !transport->tx_buffer || 
        !transport->frame_buffer || !transport->partial_message) {
        ESP_LOGE(TAG, "Failed to allocate buffers");
        goto cleanup;
    }
    
    /* Initialize transport-specific components */
    esp_err_t ret = ESP_OK;
    switch (config->type) {
        case MCP_TRANSPORT_TYPE_UART:
        case MCP_TRANSPORT_TYPE_USB_CDC:
            ret = mcp_transport_uart_init(transport);
            break;
            
        case MCP_TRANSPORT_TYPE_WIFI_TCP:
            ESP_LOGE(TAG, "TCP transport not implemented yet");
            ret = ESP_ERR_NOT_SUPPORTED;
            break;
            
        case MCP_TRANSPORT_TYPE_BLE:
            ESP_LOGE(TAG, "BLE transport not implemented yet");
            ret = ESP_ERR_NOT_SUPPORTED;
            break;
            
        default:
            ret = ESP_ERR_NOT_SUPPORTED;
            break;
    }
    
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialize transport: %s", esp_err_to_name(ret));
        goto cleanup;
    }
    
    /* Initialize state */
    transport->state = MCP_TRANSPORT_STATE_DISCONNECTED;
    transport->initialized = true;
    memset(&transport->stats, 0, sizeof(mcp_transport_stats_t));
    
    *transport_handle = transport;
    ESP_LOGI(TAG, "MCP transport initialized successfully");
    return ESP_OK;
    
cleanup:
    if (transport->partial_message) free(transport->partial_message);
    if (transport->frame_buffer) free(transport->frame_buffer);
    if (transport->tx_buffer) free(transport->tx_buffer);
    if (transport->rx_buffer) free(transport->rx_buffer);
    if (transport->tx_queue) vQueueDelete(transport->tx_queue);
    if (transport->mutex) vSemaphoreDelete(transport->mutex);
    free(transport);
    return ret;
}

