binaryninja/ESP-C6/firmware/components/tinymcp/src/esp32_transport.cpp
/* Start transport layer */
esp_err_t esp32_mcp_transport_start(esp32_mcp_transport_handle_t transport_handle)
{
    if (!transport_handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)transport_handle;
    
    if (!transport->initialized) {
        ESP_LOGE(TAG, "Transport not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (transport->running) {
        ESP_LOGW(TAG, "Transport already running");
        return ESP_OK;
    }
    
    ESP_LOGI(TAG, "Starting MCP transport");
    
    mcp_transport_set_state(transport, MCP_TRANSPORT_STATE_CONNECTING);
    
    /* Create RX task */
    BaseType_t task_ret = xTaskCreate(mcp_transport_rx_task, 
                                     "mcp_transport_rx", 
                                     4096,
                                     transport, 
                                     5, 
                                     &transport->rx_task);
    if (task_ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create RX task");
        return ESP_ERR_NO_MEM;
    }
    
    /* Create TX task */
    task_ret = xTaskCreate(mcp_transport_tx_task, 
                          "mcp_transport_tx", 
                          4096,
                          transport, 
                          5, 
                          &transport->tx_task);
    if (task_ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create TX task");
        vTaskDelete(transport->rx_task);
        return ESP_ERR_NO_MEM;
    }
    
    transport->running = true;
    mcp_transport_set_state(transport, MCP_TRANSPORT_STATE_CONNECTED);
    
    ESP_LOGI(TAG, "MCP transport started successfully");
    return ESP_OK;
}

/* Stop transport layer */
esp_err_t esp32_mcp_transport_stop(esp32_mcp_transport_handle_t transport_handle)
{
    if (!transport_handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)transport_handle;
    
    if (!transport->running) {
        ESP_LOGW(TAG, "Transport not running");
        return ESP_OK;
    }
    
    ESP_LOGI(TAG, "Stopping MCP transport");
    
    mcp_transport_set_state(transport, MCP_TRANSPORT_STATE_DISCONNECTING);
    transport->running = false;
    
    /* Delete tasks */
    if (transport->rx_task) {
        vTaskDelete(transport->rx_task);
        transport->rx_task = NULL;
    }
    
    if (transport->tx_task) {
        vTaskDelete(transport->tx_task);
        transport->tx_task = NULL;
    }
    
    mcp_transport_set_state(transport, MCP_TRANSPORT_STATE_DISCONNECTED);
    ESP_LOGI(TAG, "MCP transport stopped");
    return ESP_OK;
}

/* Deinitialize transport layer */
esp_err_t esp32_mcp_transport_deinit(esp32_mcp_transport_handle_t transport_handle)
{
    if (!transport_handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)transport_handle;
    
    /* Stop transport if running */
    if (transport->running) {
        esp32_mcp_transport_stop(transport_handle);
    }
    
    ESP_LOGI(TAG, "Deinitializing MCP transport");
    
    /* Cleanup transport-specific components */
    switch (transport->config.type) {
        case MCP_TRANSPORT_TYPE_UART:
        case MCP_TRANSPORT_TYPE_USB_CDC:
            mcp_transport_uart_deinit(transport);
            break;
        default:
            break;
    }
    
    /* Free buffers */
    if (transport->partial_message) free(transport->partial_message);
    if (transport->frame_buffer) free(transport->frame_buffer);
    if (transport->tx_buffer) free(transport->tx_buffer);
    if (transport->rx_buffer) free(transport->rx_buffer);
    
    /* Cleanup synchronization objects */
    if (transport->tx_queue) {
        vQueueDelete(transport->tx_queue);
    }
    if (transport->mutex) {
        vSemaphoreDelete(transport->mutex);
    }
    
    free(transport);
    ESP_LOGI(TAG, "MCP transport deinitialized");
    return ESP_OK;
}

/* UART transport initialization */
static esp_err_t mcp_transport_uart_init(esp32_mcp_transport_t* transport)
{
    const mcp_uart_config_t* uart_config = &transport->config.config.uart;
    
    uart_config_t config = {
        .baud_rate = uart_config->baud_rate,
        .data_bits = uart_config->data_bits,
        .parity = uart_config->parity,
        .stop_bits = uart_config->stop_bits,
        .flow_ctrl = uart_config->flow_ctrl,
        .rx_flow_ctrl_thresh = 122,
        .source_clk = UART_SCLK_DEFAULT,
    };
    
    esp_err_t ret = uart_param_config(uart_config->uart_num, &config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to configure UART: %s", esp_err_to_name(ret));
        return ret;
    }
    
    ret = uart_set_pin(uart_config->uart_num, 
                       uart_config->tx_pin, 
                       uart_config->rx_pin,
                       uart_config->rts_pin, 
                       uart_config->cts_pin);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set UART pins: %s", esp_err_to_name(ret));
        return ret;
    }
    
    ret = uart_driver_install(uart_config->uart_num, 
                             transport->config.rx_buffer_size * 2,
                             transport->config.tx_buffer_size * 2, 
                             transport->config.queue_size,
                             &transport->uart_queue, 0);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to install UART driver: %s", esp_err_to_name(ret));
        return ret;
    }
    
    transport->uart_port = uart_config->uart_num;
    ESP_LOGI(TAG, "UART transport initialized (port: %d, baud: %d)", 
             uart_config->uart_num, uart_config->baud_rate);
    
    return ESP_OK;
}

/* UART transport deinitialization */
static esp_err_t mcp_transport_uart_deinit(esp32_mcp_transport_t* transport)
{
    uart_driver_delete(transport->uart_port);
    return ESP_OK;
}

/* RX task */
static void mcp_transport_rx_task(void* arg)
{
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)arg;
    uart_event_t event;
    
    ESP_LOGI(TAG, "MCP transport RX task started");
    
    while (transport->running) {
        if (xQueueReceive(transport->uart_queue, &event, pdMS_TO_TICKS(1000)) == pdTRUE) {
            switch (event.type) {
                case UART_DATA:
                    if (event.size > 0) {
                        int length = uart_read_bytes(transport->uart_port, 
                                                   transport->rx_buffer, 
                                                   event.size, 
                                                   pdMS_TO_TICKS(100));
                        if (length > 0) {
                            transport->stats.bytes_received += length;
                            mcp_process_received_data(transport, transport->rx_buffer, length);
                        }
                    }
                    break;
                    
                case UART_FIFO_OVF:
                    ESP_LOGW(TAG, "UART FIFO overflow");
                    uart_flush_input(transport->uart_port);
                    transport->stats.buffer_overruns++;
                    break;
                    
