binaryninja/ESP-C6/firmware/components/tinymcp/src/esp32_transport.cpp
                case UART_BUFFER_FULL:
                    ESP_LOGW(TAG, "UART buffer full");
                    uart_flush_input(transport->uart_port);
                    transport->stats.buffer_overruns++;
                    break;
                    
                case UART_BREAK:
                case UART_PARITY_ERR:
                case UART_FRAME_ERR:
                    ESP_LOGW(TAG, "UART error event: %d", event.type);
                    transport->stats.error_count++;
                    break;
                    
                default:
                    break;
            }
        }
    }
    
    ESP_LOGI(TAG, "MCP transport RX task stopped");
    vTaskDelete(NULL);
}

/* TX task */
static void mcp_transport_tx_task(void* arg)
{
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)arg;
    mcp_transport_message_t* message;
    
    ESP_LOGI(TAG, "MCP transport TX task started");
    
    while (transport->running) {
        if (xQueueReceive(transport->tx_queue, &message, pdMS_TO_TICKS(1000)) == pdTRUE) {
            if (message && message->data && message->length > 0) {
                size_t bytes_to_send = message->length;
                const uint8_t* data_to_send = message->data;
                
                /* Frame message if enabled */
                if (transport->config.enable_framing) {
                    size_t framed_length;
                    esp_err_t ret = esp32_mcp_transport_frame_message(message->data, 
                                                                    message->length,
                                                                    transport->frame_buffer,
                                                                    transport->config.tx_buffer_size * 2,
                                                                    &framed_length);
                    if (ret == ESP_OK) {
                        data_to_send = transport->frame_buffer;
                        bytes_to_send = framed_length;
                    } else {
                        ESP_LOGW(TAG, "Failed to frame message, sending raw");
                    }
                }
                
                /* Send data */
                int sent = uart_write_bytes(transport->uart_port, data_to_send, bytes_to_send);
                if (sent > 0) {
                    transport->stats.bytes_sent += sent;
                    transport->stats.messages_sent++;
                    mcp_transport_send_event(transport, MCP_TRANSPORT_EVENT_DATA_SENT, message);
                } else {
                    ESP_LOGW(TAG, "Failed to send message");
                    transport->stats.error_count++;
                }
            }
            
            /* Free message */
            esp32_mcp_transport_free_message(message);
        }
    }
    
    ESP_LOGI(TAG, "MCP transport TX task stopped");
    vTaskDelete(NULL);
}

/* Process received data */
static esp_err_t mcp_process_received_data(esp32_mcp_transport_t* transport, 
                                          const uint8_t* data, size_t length)
{
    if (!transport->config.enable_framing) {
        /* No framing - treat as complete message */
        mcp_transport_message_t* message = esp32_mcp_transport_alloc_message(length);
        if (message) {
            memcpy(message->data, data, length);
            message->length = length;
            message->timestamp = esp_timer_get_time();
            message->connection_id = 0;
            
            transport->stats.messages_received++;
            
            if (transport->message_callback) {
                transport->message_callback(transport, message, transport->callback_user_data);
            } else {
                esp32_mcp_transport_free_message(message);
            }
        }
        return ESP_OK;
    }
    
    /* Process framed data */
    for (size_t i = 0; i < length; i++) {
        uint8_t byte = data[i];
        
        if (transport->escape_next) {
            /* Previous byte was escape character */
            transport->escape_next = false;
            byte ^= MCP_MESSAGE_ESCAPE_XOR;
            
            if (transport->partial_length < transport->config.rx_buffer_size) {
                transport->partial_message[transport->partial_length++] = byte;
            } else {
                /* Buffer overflow */
                transport->stats.buffer_overruns++;
                transport->partial_length = 0;
                transport->in_frame = false;
            }
            
        } else if (byte == MCP_MESSAGE_START_MARKER) {
            /* Start of new frame */
            transport->in_frame = true;
            transport->partial_length = 0;
            
        } else if (byte == MCP_MESSAGE_END_MARKER) {
            /* End of frame */
            if (transport->in_frame && transport->partial_length > 0) {
                /* Complete message received */
                mcp_transport_message_t* message = esp32_mcp_transport_alloc_message(transport->partial_length);
                if (message) {
                    memcpy(message->data, transport->partial_message, transport->partial_length);
                    message->length = transport->partial_length;
                    message->timestamp = esp_timer_get_time();
                    message->connection_id = 0;
                    
                    transport->stats.messages_received++;
                    
                    if (transport->message_callback) {
                        transport->message_callback(transport, message, transport->callback_user_data);
                    } else {
                        esp32_mcp_transport_free_message(message);
                    }
                }
            }
            transport->in_frame = false;
            transport->partial_length = 0;
            
        } else if (byte == MCP_MESSAGE_ESCAPE_CHAR) {
            /* Escape character - next byte is escaped */
            transport->escape_next = true;
            
