binaryninja/ESP-C6/firmware/components/tinymcp/src/esp32_transport.cpp
        } else if (transport->in_frame) {
            /* Regular data byte */
            if (transport->partial_length < transport->config.rx_buffer_size) {
                transport->partial_message[transport->partial_length++] = byte;
            } else {
                /* Buffer overflow */
                transport->stats.buffer_overruns++;
                transport->partial_length = 0;
                transport->in_frame = false;
            }
        }
        /* Ignore bytes outside of frames */
    }
    
    return ESP_OK;
}

/* Set transport state */
static void mcp_transport_set_state(esp32_mcp_transport_t* transport, 
                                   mcp_transport_state_t new_state)
{
    if (transport->state != new_state) {
        transport->state = new_state;
        mcp_transport_send_event(transport, 
                                new_state == MCP_TRANSPORT_STATE_CONNECTED ? 
                                MCP_TRANSPORT_EVENT_CONNECTED : MCP_TRANSPORT_EVENT_DISCONNECTED, 
                                NULL);
    }
}

/* Send event to callback */
static void mcp_transport_send_event(esp32_mcp_transport_t* transport, 
                                    mcp_transport_event_t event, void* data)
{
    if (transport->event_callback) {
        transport->event_callback(transport, event, data, transport->callback_user_data);
    }
}

/* Public API implementations */

esp_err_t esp32_mcp_transport_set_message_callback(esp32_mcp_transport_handle_t transport_handle,
                                                   mcp_transport_message_cb_t callback,
                                                   void* user_data)
{
    if (!transport_handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)transport_handle;
    transport->message_callback = callback;
    transport->callback_user_data = user_data;
    
    return ESP_OK;
}

esp_err_t esp32_mcp_transport_set_event_callback(esp32_mcp_transport_handle_t transport_handle,
                                                 mcp_transport_event_cb_t callback,
                                                 void* user_data)
{
    if (!transport_handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)transport_handle;
    transport->event_callback = callback;
    transport->callback_user_data = user_data;
    
    return ESP_OK;
}

esp_err_t esp32_mcp_transport_send_data(esp32_mcp_transport_handle_t transport_handle,
                                        const uint8_t* data,
                                        size_t length,
                                        uint32_t connection_id)
{
    if (!transport_handle || !data || length == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)transport_handle;
    
    if (!transport->running) {
        return ESP_ERR_INVALID_STATE;
    }
    
    mcp_transport_message_t* message = esp32_mcp_transport_alloc_message(length);
    if (!message) {
        return ESP_ERR_NO_MEM;
    }
    
    memcpy(message->data, data, length);
    message->length = length;
    message->connection_id = connection_id;
    message->timestamp = esp_timer_get_time();
    
    if (xQueueSend(transport->tx_queue, &message, pdMS_TO_TICKS(1000)) != pdTRUE) {
        esp32_mcp_transport_free_message(message);
        return ESP_ERR_TIMEOUT;
    }
    
    return ESP_OK;
}

bool esp32_mcp_transport_is_connected(esp32_mcp_transport_handle_t transport_handle)
{
    if (!transport_handle) {
        return false;
    }
    
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)transport_handle;
    return transport->state == MCP_TRANSPORT_STATE_CONNECTED;
}

mcp_transport_message_t* esp32_mcp_transport_alloc_message(size_t capacity)
{
    mcp_transport_message_t* message = (mcp_transport_message_t*)heap_caps_malloc(
        sizeof(mcp_transport_message_t), MALLOC_CAP_DEFAULT);
    if (!message) {
        return NULL;
    }
    
    message->data = (uint8_t*)heap_caps_malloc(capacity, MALLOC_CAP_DEFAULT);
    if (!message->data) {
        free(message);
        return NULL;
    }
    
    message->capacity = capacity;
    message->length = 0;
    message->timestamp = 0;
    message->connection_id = 0;
    
    return message;
}

void esp32_mcp_transport_free_message(mcp_transport_message_t* message)
{
    if (message) {
        if (message->data) {
            free(message->data);
        }
        free(message);
    }
}

esp_err_t esp32_mcp_transport_frame_message(const uint8_t* input,
                                            size_t input_len,
                                            uint8_t* output,
                                            size_t output_size,
                                            size_t* output_len)
{
    if (!input || !output || !output_len || input_len == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    
    size_t required_size = input_len * 2 + 2; // Worst case: all bytes escaped + start/end markers
    if (output_size < required_size) {
        return ESP_ERR_INVALID_SIZE;
    }
    
    size_t pos = 0;
    
    /* Start marker */
    output[pos++] = MCP_MESSAGE_START_MARKER;
    
    /* Escape and copy data */
    for (size_t i = 0; i < input_len; i++) {
        uint8_t byte = input[i];
        
        if (byte == MCP_MESSAGE_START_MARKER || 
            byte == MCP_MESSAGE_END_MARKER || 
            byte == MCP_MESSAGE_ESCAPE_CHAR) {
            /* Escape special characters */
            output[pos++] = MCP_MESSAGE_ESCAPE_CHAR;
            output[pos++] = byte ^ MCP_MESSAGE_ESCAPE_XOR;
        } else {
            /* Regular byte */
            output[pos++] = byte;
        }
    }
    
    /* End marker */
    output[pos++] = MCP_MESSAGE_END_MARKER;
    
    *output_len = pos;
    return ESP_OK;
}

esp_err_t esp32_mcp_transport_unframe_message(const uint8_t* input,
                                              size_t input_len,
                                              uint8_t* output,
                                              size_t output_size,
                                              size_t* output_len)
{
    if (!input || !output || !output_len || input_len < 2) {
        return ESP_ERR_INVALID_ARG;
    }
    
    /* Check for start and end markers */
    if (input[0] != MCP_MESSAGE_START_MARKER || 
        input[input_len - 1] != MCP_MESSAGE_END_MARKER) {
        return ESP_ERR_INVALID_ARG;
    }
    
    size_t pos = 0;
    bool escape_next = false;
    
    /* Process bytes between markers */
    for (size_t i = 1; i < input_len - 1; i++) {
        uint8_t byte = input[i];
        
