binaryninja/ESP-C6/firmware/components/tinymcp/src/esp32_transport.cpp
        if (escape_next) {
            /* Previous byte was escape character */
            escape_next = false;
            byte ^= MCP_MESSAGE_ESCAPE_XOR;
            
            if (pos >= output_size) {
                return ESP_ERR_INVALID_SIZE;
            }
            output[pos++] = byte;
            
        } else if (byte == MCP_MESSAGE_ESCAPE_CHAR) {
            /* Escape character - next byte is escaped */
            escape_next = true;
            
        } else {
            /* Regular byte */
            if (pos >= output_size) {
                return ESP_ERR_INVALID_SIZE;
            }
            output[pos++] = byte;
        }
    }
    
    *output_len = pos;
    return ESP_OK;
}

esp_err_t esp32_mcp_transport_get_stats(esp32_mcp_transport_handle_t transport_handle,
                                        mcp_transport_stats_t* stats)
{
    if (!transport_handle || !stats) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)transport_handle;
    
    if (xSemaphoreTake(transport->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        memcpy(stats, &transport->stats, sizeof(mcp_transport_stats_t));
        xSemaphoreGive(transport->mutex);
        return ESP_OK;
    }
    
    return ESP_ERR_TIMEOUT;
}

mcp_transport_state_t esp32_mcp_transport_get_state(esp32_mcp_transport_handle_t transport_handle)
{
    if (!transport_handle) {
        return MCP_TRANSPORT_STATE_ERROR;
    }
    
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)transport_handle;
    return transport->state;
}

uint32_t esp32_mcp_transport_get_connection_count(esp32_mcp_transport_handle_t transport_handle)
{
    if (!transport_handle) {
        return 0;
    }
    
    esp32_mcp_transport_t* transport = (esp32_mcp_transport_t*)transport_handle;
    return transport->running ? 1 : 0; // Single connection for UART
}